{
    "projects": {
        "keithalleman": {
            "name": "KeithAlleman.com",
            "used": "React",
            "description": "This is the website you're currently viewing. I built this project to display my work while also providing some insight into the person behind the work. I learned about integrating animations into my web pages with this app and using stubs within the app for cases where I don't need to store data in a larger secure database.",
            "linkGithub": "https://github.com/armoredelephant/keith_alleman_dot_com",
            "visit": true,
            "linkUrl": "https://wwww.keithalleman.com",
            "skills": [
                "Animations",
                "Testing",
                "Linting",
                "React Hooks",
                "Styled Components",
                "Atomic Design"
            ]
        },
        "playlistrandomizer": {
            "name": "WORK IN PROGRESS",
            "used": "React & Node.JS",
            "description": "This web app will work with an authenticated spotify account, and will access the user's saved playlists. The user can set a timer and when the time is up, it will select another playlist to play at random.  This project was thought up to save me from having to change the spotify playlist at work on a regular bases. Through this project I learned more about the importance of reading through documentation and following along through tutorials provided for APIs. I also learned a lot about user authentication and tokens.",
            "linkGithub": "https://github.com/armoredelephant/playlist_randomizer",
            "visit": true,
            "linkUrl": "tbd",
            "skills": [
                "Authentication",
                "Documentation",
                "Media Player"
            ]
        },
        "evihelp": {
            "name": "eviHelp",
            "used": "React & Node.JS",
            "description": "This was a website I built to provide easy access to remote workers. The idea was for them to be able to easily access support documents from their personal mobile devices. There is a fully integrated admin dashboard to allow adding, editing, and removal of help articles. I initially decided it was not something the company would probably use due to PHI, but it was a good beginner projectl. I learned a lot about working with APIs, Google's Firebase, and really reading through documentation.",
            "linkGithub": "https://github.com/armoredelephant/evi_support_full",
            "visit": false,
            "linkUrl": null,
            "skills": [
                "Backend",
                "Firebase",
                "Following Documentation"
            ]
        },
        "evisignature": {
            "name": "eviCore Signature Creator",
            "used": "Vanilla Javascript",
            "description": "This was the first web app that I developed. I utilized bootstrap & javascript to create a tool that allowed users to build an Outlook signature. I learned quite a bit about bootstrap and refactoring for functionality accross older browsers (we used IE8 & IE10 still). It was a great project to get my feet wet with and was regularly used for new hire classes within the company. This app was hosted on one of our internal servers using WAMP.",
            "linkGithub": "https://github.com/armoredelephant/signature",
            "visit": false,
            "linkUrl": null,
            "skills": [
                "Compatibility",
                "WAMP",
                "Bootstrap"
            ]
        }
    }
}